The  ComboBoxDropDownOpenedEventArgs  type exposes the following members.
 Properties
Name  |   Description
Application
 The current UIApplication.
 (Inherited from  RibbonItemEventArgs  .)
 See Also
  ComboBoxDropDownOpenedEventArgs Class
  Autodesk.Revit.UI.Events Namespace